jaenrig-ifx/micropython/ports/psoc6/modules/network/network_ifx_whd.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2018-2019 Damien P. George
 * Copyright (c) 2023 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <string.h>
#include "py/runtime.h"
#include "py/objstr.h"
#include "py/mphal.h"

#if MICROPY_PY_NETWORK_IFX_WHD

#include "lwip/netif.h"
#include "whd.h"
#include "whd_network_types.h"
#include "whd_wlioctl.h"
#include "network_ifx_whd.h"
#include "whd_wifi_api.h"
#include "extmod/modnetwork.h"
#include "cy_wcm.h"

#include "FreeRTOS.h"

whd_driver_t whd;
whd_interface_t itf_sta;
whd_interface_t itf_ap;

typedef struct _network_ifx_whd_obj_t {
    mp_obj_base_t base;
    whd_driver_t *whd;
    whd_interface_t *itf;
    struct netif netif;
} network_ifx_whd_obj_t;

STATIC network_ifx_whd_obj_t network_ifx_whd_wl_sta = { { &mp_network_ifx_whd_type }, &whd, &itf_sta };
STATIC network_ifx_whd_obj_t network_ifx_whd_wl_ap = { { &mp_network_ifx_whd_type }, &whd, &itf_ap };

#define whd_assert_raise(ret)   if (ret != WHD_SUCCESS) { \
        mp_raise_OSError(-ret); \
}

STATIC void network_ifx_whd_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    whd_interface_t itf = *(self->itf);
    (void)itf;
//     TODO: Implement print with following parameters
//       - link status (requires tcpip stack integration)
//       - get and print ip address
    const char *status_str = "network status unknown. To be implemented.";

    mp_printf(print, "<IFY WHD %s %u.%u.%u.%u>",
        status_str,
        0, // netif->ip_addr.addr & 0xff,
        0, // netif->ip_addr.addr >> 8 & 0xff,
        0, // netif->ip_addr.addr >> 16 & 0xff,
        0 // netif->ip_addr.addr >> 24
        );
}

STATIC mp_obj_t network_ifx_whd_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 0, 1, false);

    if (n_args == 0 || mp_obj_get_int(args[0]) == MOD_NETWORK_STA_IF) {
        return MP_OBJ_FROM_PTR(&network_ifx_whd_wl_sta);
    } else {
        return MP_OBJ_FROM_PTR(&network_ifx_whd_wl_ap);
    }
    return mp_const_none;
}

STATIC mp_obj_t network_ifx_whd_send_ethernet(mp_obj_t self_in, mp_obj_t buf_in) {
    network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    whd_interface_t itf = *(self->itf);
    mp_buffer_info_t buf;
    mp_get_buffer_raise(buf_in, &buf, MP_BUFFER_READ);
    whd_buffer_t *whd_buff = (whd_buffer_t *)&buf;
    int ret = whd_network_send_ethernet_data(itf, *whd_buff);
    whd_assert_raise(ret);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(network_ifx_whd_send_ethernet_obj, network_ifx_whd_send_ethernet);

/*******************************************************************************/
// network API

STATIC mp_obj_t network_ifx_whd_deinit(mp_obj_t self_in) {
    // network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(self_in);
    // whd_interface_t itf = *(self->itf);
    // uint32_t ret = whd_deinit(itf);
    uint32_t ret = cy_wcm_deinit();
    whd_assert_raise(ret);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_whd_deinit_obj, network_ifx_whd_deinit);

STATIC mp_obj_t network_ifx_whd_active(size_t n_args, const mp_obj_t *args) {
    // network_ifx_whd_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    // whd_interface_t itf = *(self->itf);

    if (n_args == 1) {
        return mp_obj_new_bool(cy_wcm_is_connected_to_ap());
    } else {
        if (mp_obj_is_true(args[1])) {
            // whd_wifi_set_up(itf);
            /* Configure the Wi-Fi interface as a Wi-Fi STA (i.e. Client). */
            cy_wcm_config_t wcm_config = { .interface = CY_WCM_INTERFACE_TYPE_STA };
            cy_wcm_init(&wcm_config);

        } else {
            // whd_wifi_set_down(itf);
            cy_wcm_deinit();
        }
        return mp_const_none;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_whd_active_obj, 1, 2, network_ifx_whd_active);

STATIC whd_scan_result_t whd_scan_result;
STATIC volatile whd_scan_status_t whd_scan_status;

STATIC void network_ifx_whd_scan_cb(whd_scan_result_t **result_ptr, void *user_data, whd_scan_status_t status) {
    mp_obj_t list = MP_OBJ_FROM_PTR(user_data);
    whd_scan_result_t *scan_result_ptr = *result_ptr;
    // Search for existing BSSID to remove duplicates
    bool found = false;
    size_t len;
    mp_obj_t *items;
    mp_obj_get_array(list, &len, &items);
    for (size_t i = 0; i < len; ++i) {
        mp_obj_tuple_t *t = MP_OBJ_TO_PTR(items[i]);
        if (memcmp(scan_result_ptr->BSSID.octet, ((mp_obj_str_t *)MP_OBJ_TO_PTR(t->items[1]))->data, sizeof(scan_result_ptr->BSSID.octet)) == 0) {
            if (scan_result_ptr->signal_strength > MP_OBJ_SMALL_INT_VALUE(t->items[3])) {
                t->items[3] = MP_OBJ_NEW_SMALL_INT(scan_result_ptr->signal_strength);
            }
            t->items[5] = MP_OBJ_NEW_SMALL_INT(MP_OBJ_SMALL_INT_VALUE(t->items[5]) + 1);
            found = true;
            break;
        }
    }

    // Add to list of results if wanted
    // Scan info tuple
    // 0 - ssid
    // 1 - bssid
    // 2 - channel
    // 3 - rssi
    // 4 - auth mode
    // 5 - Number of result appareances
    if (!found) {
        mp_obj_t tuple[6] = {
            mp_obj_new_bytes(scan_result_ptr->SSID.value, scan_result_ptr->SSID.length),
            mp_obj_new_bytes(scan_result_ptr->BSSID.octet, sizeof(scan_result_ptr->BSSID.octet)),
            MP_OBJ_NEW_SMALL_INT(scan_result_ptr->channel),
            MP_OBJ_NEW_SMALL_INT(scan_result_ptr->signal_strength),
            MP_OBJ_NEW_SMALL_INT(scan_result_ptr->security),
            MP_OBJ_NEW_SMALL_INT(1) // N
        };
        mp_obj_list_append(list, mp_obj_new_tuple(6, tuple));
    }

    // Update scan status
    whd_scan_status = status;
}

STATIC mp_obj_t network_ifx_whd_scan(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_passive, ARG_ssid, ARG_essid, ARG_bssid, ARG_channels };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_passive, MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_ssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_essid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_channels, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    };

